zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXE316MLF-pinctrl.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXE317MPA-pinctrl.h with this part's differences applied
 * below (440 removed, 0 changed,
 * 25 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: d34e27c0d05f080f
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXE316MLF_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXE316MLF_WRAPPER_

#include "MCXE317MPA-pinctrl.h"

/* Signals not present on this part */
#undef PTA12_CMP1_OUT
#undef PTA15_FXIO_D31_I
#undef PTA15_FXIO_D31_O
#undef PTA15_LPUART6_RX
#undef PTA16_FXIO_D30_I
#undef PTA16_FXIO_D30_O
#undef PTA16_LPUART6_TX_I
#undef PTA16_LPUART6_TX_O
#undef PTA17_EMIOS_0_CH6_G_O
#undef PTA17_FXIO_D19_I
#undef PTA17_FXIO_D19_O
#undef PTA17_LPSPI3_SOUT_O
#undef PTA17_LPUART4_TX_I
#undef PTA17_LPUART4_TX_O
#undef PTA18_EIRQ0
#undef PTA18_EMIOS_1_CH0_X_I
#undef PTA18_EMIOS_1_CH0_X_O
#undef PTA18_EMIOS_1_CH16_X_I
#undef PTA18_EMIOS_1_CH16_X_O
#undef PTA18_LPSPI1_SOUT_I
#undef PTA18_LPSPI1_SOUT_O
#undef PTA18_LPUART1_TX_I
#undef PTA18_LPUART1_TX_O
#undef PTA18_TRGMUX_IN12
#undef PTA19_EIRQ1
#undef PTA19_EMIOS_1_CH1_H_I
#undef PTA19_EMIOS_1_CH1_H_O
#undef PTA19_LPSPI1_SCK_I
#undef PTA19_LPSPI1_SCK_O
#undef PTA19_LPUART1_RX
#undef PTA19_TRGMUX_IN13
#undef PTA20_EIRQ2
#undef PTA20_EMIOS_1_CH2_H_I
#undef PTA20_EMIOS_1_CH2_H_O
#undef PTA20_LPSPI1_SIN_I
#undef PTA20_LPSPI1_SIN_O
#undef PTA20_TRGMUX_IN14
#undef PTA21_EIRQ3
#undef PTA21_EMIOS_1_CH3_H_I
#undef PTA21_EMIOS_1_CH3_H_O
#undef PTA21_FXIO_D0_I
#undef PTA21_FXIO_D0_O
#undef PTA21_LPSPI1_PCS0_I
#undef PTA21_LPSPI1_PCS0_O
#undef PTA21_LPSPI2_PCS2_I
#undef PTA21_LPSPI2_PCS2_O
#undef PTA21_TRGMUX_IN15
#undef PTA24_EMIOS_1_CH7_H
#undef PTA24_FXIO_D3
#undef PTA24_GPI24
#undef PTA25_EIRQ5
#undef PTA25_EMIOS_1_CH8_X
#undef PTA25_FXIO_D2
#undef PTA25_GPI25
#undef PTA27_CAN0_TX
#undef PTA27_EMIOS_1_CH10_H_I
#undef PTA27_EMIOS_1_CH10_H_O
#undef PTA27_FXIO_D5_I
#undef PTA27_FXIO_D5_O
#undef PTA27_LPUART0_TX_I
#undef PTA27_LPUART0_TX_O
#undef PTA28_CAN0_RX
#undef PTA28_EIRQ6
#undef PTA28_EMIOS_1_CH11_H_I
#undef PTA28_EMIOS_1_CH11_H_O
#undef PTA28_LPSPI1_SCK_I
#undef PTA28_LPSPI1_SCK_O
#undef PTA28_LPUART0_RX
#undef PTA29_EMIOS_1_CH12_H_I
#undef PTA29_EMIOS_1_CH12_H_O
#undef PTA29_LPSPI1_SIN_I
#undef PTA29_LPSPI1_SIN_O
#undef PTA29_LPUART2_TX_I
#undef PTA29_LPUART2_TX_O
#undef PTA30_EIRQ7
#undef PTA30_EMIOS_1_CH13_H_I
#undef PTA30_EMIOS_1_CH13_H_O
#undef PTA30_LPSPI0_SOUT_I
#undef PTA30_LPSPI0_SOUT_O
#undef PTA30_LPSPI1_SOUT_I
#undef PTA30_LPSPI1_SOUT_O
#undef PTA30_LPUART2_RX
#undef PTA31_EMIOS_1_CH14_H_I
#undef PTA31_EMIOS_1_CH14_H_O
#undef PTA31_FXIO_D0_I
#undef PTA31_FXIO_D0_O
#undef PTA31_LPSPI0_PCS1_I
#undef PTA31_LPSPI0_PCS1_O
#undef PTA31_TRGMUX_OUT8
#undef PTA6_FXIO_D19_I
#undef PTA6_FXIO_D19_O
#undef PTB10_FXIO_D27_I
#undef PTB10_FXIO_D27_O
#undef PTB11_FXIO_D26_I
#undef PTB11_FXIO_D26_O
#undef PTB12_FXIO_D25_I
#undef PTB12_FXIO_D25_O
#undef PTB13_FXIO_D24_I
#undef PTB13_FXIO_D24_O
#undef PTB14_FXIO_D23_I
#undef PTB14_FXIO_D23_O
#undef PTB14_LPUART7_RX
#undef PTB15_FXIO_D22_I
#undef PTB15_FXIO_D22_O
#undef PTB15_LPUART7_TX_I
#undef PTB15_LPUART7_TX_O
#undef PTB16_FXIO_D21_I
#undef PTB16_FXIO_D21_O
#undef PTB16_LPUART4_TX_I
#undef PTB16_LPUART4_TX_O
#undef PTB17_FXIO_D20_I
#undef PTB17_FXIO_D20_O
#undef PTB17_LPUART4_RX
#undef PTB18_EMIOS_1_CH15_H_I
#undef PTB18_EMIOS_1_CH15_H_O
#undef PTB18_FXIO_D1_I
#undef PTB18_FXIO_D1_O
#undef PTB18_LPSPI1_PCS1_I
#undef PTB18_LPSPI1_PCS1_O
#undef PTB18_TRGMUX_OUT9
#undef PTB19_EMIOS_1_CH15_H_I
#undef PTB19_EMIOS_1_CH15_H_O
#undef PTB19_FXIO_D2_I
#undef PTB19_FXIO_D2_O
#undef PTB19_TRGMUX_OUT10
#undef PTB20_EMIOS_1_CH16_X_I
#undef PTB20_EMIOS_1_CH16_X_O
#undef PTB20_FXIO_D3_I
#undef PTB20_FXIO_D3_O
#undef PTB20_TRGMUX_OUT11
#undef PTB21_EIRQ8
#undef PTB21_EMIOS_1_CH17_Y_I
#undef PTB21_EMIOS_1_CH17_Y_O
#undef PTB21_FXIO_D4_I
#undef PTB21_FXIO_D4_O
#undef PTB21_TRGMUX_OUT12
#undef PTB22_CAN1_TX
#undef PTB22_EIRQ9
#undef PTB22_EMIOS_1_CH18_Y_I
#undef PTB22_EMIOS_1_CH18_Y_O
#undef PTB22_FXIO_D15_I
#undef PTB22_FXIO_D15_O
#undef PTB22_LPSPI3_PCS1_I
#undef PTB22_LPSPI3_PCS1_O
#undef PTB22_LPUART1_TX_I
#undef PTB22_LPUART1_TX_O
#undef PTB22_TRGMUX_OUT13
#undef PTB23_ADC1_MA0
#undef PTB23_CAN1_RX
#undef PTB23_EIRQ10
#undef PTB23_EMIOS_1_CH19_Y_I
#undef PTB23_EMIOS_1_CH19_Y_O
#undef PTB23_FXIO_D4_I
#undef PTB23_FXIO_D4_O
#undef PTB23_LPUART1_RX
#undef PTB23_TRGMUX_OUT14
#undef PTB24_ADC1_MA1
#undef PTB24_EIRQ11
#undef PTB24_EMIOS_1_CH20_Y_I
#undef PTB24_EMIOS_1_CH20_Y_O
#undef PTB24_FXIO_D5_I
#undef PTB24_FXIO_D5_O
#undef PTB25_EIRQ12
#undef PTB25_EMIOS_1_CH21_Y_I
#undef PTB25_EMIOS_1_CH21_Y_O
#undef PTB25_FXIO_D6_I
#undef PTB25_FXIO_D6_O
#undef PTB25_LPSPI2_PCS0_I
#undef PTB25_LPSPI2_PCS0_O
#undef PTB26_EIRQ13
#undef PTB26_EMIOS_1_CH22_X_I
#undef PTB26_EMIOS_1_CH22_X_O
#undef PTB26_FXIO_D7_I
#undef PTB26_FXIO_D7_O
#undef PTB27_EMIOS_1_CH23_X_I
#undef PTB27_EMIOS_1_CH23_X_O
#undef PTB27_FXIO_D8_I
#undef PTB27_FXIO_D8_O
#undef PTB27_LPSPI2_SOUT_I
#undef PTB27_LPSPI2_SOUT_O
#undef PTB27_LPUART5_TX_I
#undef PTB27_LPUART5_TX_O
#undef PTB28_ADC1_MA2
#undef PTB28_EIRQ14
#undef PTB28_FXIO_D9_I
#undef PTB28_FXIO_D9_O
#undef PTB28_LCU1_OUT11
#undef PTB28_LPSPI2_SIN_I
#undef PTB28_LPSPI2_SIN_O
#undef PTB28_LPUART5_RX
#undef PTB29_FXIO_D10_I
#undef PTB29_FXIO_D10_O
#undef PTB29_LCU1_OUT10
#undef PTB29_LPSPI2_SCK_I
#undef PTB29_LPSPI2_SCK_O
#undef PTB29_LPUART6_TX_I
#undef PTB29_LPUART6_TX_O
#undef PTB2_CAN4_RX
#undef PTB2_FXIO_D18_I
#undef PTB2_FXIO_D18_O
#undef PTB30_FXIO_D11_I
#undef PTB30_FXIO_D11_O
#undef PTB30_HSE_TAMPER_LOOP_OUT0
#undef PTB3_CAN4_TX
#undef PTB3_FXIO_D17_I
#undef PTB3_FXIO_D17_O
#undef PTB8_FXIO_D29_I
#undef PTB8_FXIO_D29_O
#undef PTB9_FXIO_D28_I
#undef PTB9_FXIO_D28_O
#undef PTC0_CAN3_TX
#undef PTC10_CAN5_TX
#undef PTC11_CAN5_RX
#undef PTC11_FXIO_D19_I
#undef PTC11_FXIO_D19_O
#undef PTC12_FXIO_D19_I
#undef PTC12_FXIO_D19_O
#undef PTC13_FXIO_D16_I
#undef PTC13_FXIO_D16_O
#undef PTC14_FXIO_D16_I
#undef PTC14_FXIO_D16_O
#undef PTC18_FXIO_D12_I
#undef PTC18_FXIO_D12_O
#undef PTC18_FXIO_D6_I
#undef PTC18_FXIO_D6_O
#undef PTC18_LCU1_OUT7
#undef PTC18_LPUART6_RX
#undef PTC19_FXIO_D13_I
#undef PTC19_FXIO_D13_O
#undef PTC19_LCU1_OUT6
#undef PTC19_LPSPI2_PCS1_I
#undef PTC19_LPSPI2_PCS1_O
#undef PTC19_LPUART7_TX_I
#undef PTC19_LPUART7_TX_O
#undef PTC1_CAN3_RX
#undef PTC20_ADC1_MA2
#undef PTC20_EIRQ16
#undef PTC20_FXIO_D14_I
#undef PTC20_FXIO_D14_O
#undef PTC20_LCU1_OUT5
#undef PTC20_LPUART7_RX
#undef PTC21_ADC1_MA1
#undef PTC21_EIRQ17
#undef PTC21_FXIO_D15_I
#undef PTC21_FXIO_D15_O
#undef PTC21_LCU1_OUT4
#undef PTC23_EIRQ18
#undef PTC23_FXIO_D16_I
#undef PTC23_FXIO_D16_O
#undef PTC23_LCU1_OUT0
#undef PTC24_EIRQ19
#undef PTC24_EMIOS_1_CH0_X_I
#undef PTC24_EMIOS_1_CH0_X_O
#undef PTC24_FXIO_D17_I
#undef PTC24_FXIO_D17_O
#undef PTC24_LCU1_OUT1
#undef PTC24_TRGMUX_OUT15
#undef PTC25_EIRQ20
#undef PTC25_EMIOS_1_CH1_H_I
#undef PTC25_EMIOS_1_CH1_H_O
#undef PTC25_FXIO_D18_I
#undef PTC25_FXIO_D18_O
#undef PTC25_LCU1_OUT2
#undef PTC26_CAN5_RX
#undef PTC26_EIRQ21
#undef PTC26_EMIOS_1_CH3_H_I
#undef PTC26_EMIOS_1_CH3_H_O
#undef PTC26_FXIO_D19_I
#undef PTC26_FXIO_D19_O
#undef PTC26_LCU1_OUT9
#undef PTC27_ADC1_MA0
#undef PTC27_CAN5_TX
#undef PTC27_EIRQ22
#undef PTC27_EMIOS_1_CH4_H_I
#undef PTC27_EMIOS_1_CH4_H_O
#undef PTC27_FXIO_D20_I
#undef PTC27_FXIO_D20_O
#undef PTC27_LCU1_OUT3
#undef PTC28_CAN3_TX
#undef PTC28_EMIOS_1_CH7_H_I
#undef PTC28_EMIOS_1_CH7_H_O
#undef PTC28_FXIO_D21_I
#undef PTC28_FXIO_D21_O
#undef PTC28_FXIO_D2_I
#undef PTC28_FXIO_D2_O
#undef PTC28_LCU1_OUT8
#undef PTC28_LPI2C1_SCL_I
#undef PTC28_LPI2C1_SCL_O
#undef PTC29_CAN3_RX
#undef PTC29_EIRQ23
#undef PTC29_EMIOS_1_CH10_H_I
#undef PTC29_EMIOS_1_CH10_H_O
#undef PTC29_FXIO_D22_I
#undef PTC29_FXIO_D22_O
#undef PTC29_FXIO_D3_I
#undef PTC29_FXIO_D3_O
#undef PTC29_LPI2C1_SDA_I
#undef PTC29_LPI2C1_SDA_O
#undef PTC30_CAN4_TX
#undef PTC30_EMIOS_1_CH12_H_I
#undef PTC30_EMIOS_1_CH12_H_O
#undef PTC30_FXIO_D0_I
#undef PTC30_FXIO_D0_O
#undef PTC30_FXIO_D23_I
#undef PTC30_FXIO_D23_O
#undef PTC31_CAN4_RX
#undef PTC31_EMIOS_1_CH14_H_I
#undef PTC31_EMIOS_1_CH14_H_O
#undef PTC31_FXIO_D1_I
#undef PTC31_FXIO_D1_O
#undef PTC31_FXIO_D24_I
#undef PTC31_FXIO_D24_O
#undef PTD0_LPUART5_RX
#undef PTD15_CAN3_RX
#undef PTD17_CAN5_RX
#undef PTD18_CAN2_TX
#undef PTD18_EMIOS_1_CH15_H_I
#undef PTD18_EMIOS_1_CH15_H_O
#undef PTD18_FXIO_D2_I
#undef PTD18_FXIO_D2_O
#undef PTD1_LPUART5_TX_I
#undef PTD1_LPUART5_TX_O
#undef PTD20_EIRQ25
#undef PTD20_EMIOS_1_CH17_Y_I
#undef PTD20_EMIOS_1_CH17_Y_O
#undef PTD20_FXIO_D25_I
#undef PTD20_FXIO_D25_O
#undef PTD20_LPSPI1_PCS2_I
#undef PTD20_LPSPI1_PCS2_O
#undef PTD20_LPSPI3_SIN_I
#undef PTD20_LPSPI3_SIN_O
#undef PTD21_EIRQ26
#undef PTD21_EMIOS_1_CH18_Y_I
#undef PTD21_EMIOS_1_CH18_Y_O
#undef PTD21_FXIO_D26_I
#undef PTD21_FXIO_D26_O
#undef PTD21_LCU0_OUT4
#undef PTD22_EIRQ27
#undef PTD22_EMIOS_1_CH19_Y_I
#undef PTD22_EMIOS_1_CH19_Y_O
#undef PTD22_FXIO_D27_I
#undef PTD22_FXIO_D27_O
#undef PTD22_LCU0_OUT5
#undef PTD23_EIRQ28
#undef PTD23_EMIOS_1_CH20_Y_I
#undef PTD23_EMIOS_1_CH20_Y_O
#undef PTD23_FXIO_D28_I
#undef PTD23_FXIO_D28_O
#undef PTD23_HSE_TAMPER_LOOP_OUT0
#undef PTD23_LCU0_OUT10
#undef PTD24_EIRQ29
#undef PTD24_EMIOS_1_CH21_Y_I
#undef PTD24_EMIOS_1_CH21_Y_O
#undef PTD24_FXIO_D29_I
#undef PTD24_FXIO_D29_O
#undef PTD24_HSE_TAMPER_EXTIN0
#undef PTD24_LCU0_OUT11
#undef PTD26_EMIOS_1_CH23_X_I
#undef PTD26_EMIOS_1_CH23_X_O
#undef PTD26_FXIO_D30_I
#undef PTD26_FXIO_D30_O
#undef PTD26_FXIO_D7_I
#undef PTD26_FXIO_D7_O
#undef PTD26_LCU0_OUT0
#undef PTD27_EIRQ30
#undef PTD27_FXIO_D31_I
#undef PTD27_FXIO_D31_O
#undef PTD27_LCU0_OUT1
#undef PTD28_EIRQ31
#undef PTD28_LCU0_OUT2
#undef PTD29_LCU0_OUT3
#undef PTD30_LCU0_OUT8
#undef PTD31_FXIO_D6_I
#undef PTD31_FXIO_D6_O
#undef PTD31_LCU0_OUT9
#undef PTD8_LPUART6_RX
#undef PTD9_LPUART6_TX_I
#undef PTD9_LPUART6_TX_O
#undef PTE0_LPUART7_RX
#undef PTE10_LPUART4_RX
#undef PTE11_LPUART4_TX_I
#undef PTE11_LPUART4_TX_O
#undef PTE12_CAN5_TX
#undef PTE14_CAN4_RX
#undef PTE14_EIRQ13
#undef PTE14_EMIOS_0_CH19_Y_I
#undef PTE14_EMIOS_0_CH19_Y_O
#undef PTE14_FXIO_D7_I
#undef PTE14_FXIO_D7_O
#undef PTE14_LPUART5_TX_I
#undef PTE14_LPUART5_TX_O
#undef PTE15_CMP1_RR_ACTIVE
#undef PTE17_FXIO_D5_I
#undef PTE17_FXIO_D5_O
#undef PTE18_FXIO_D4_I
#undef PTE18_FXIO_D4_O
#undef PTE19_EMIOS_0_CH22_X_I
#undef PTE19_EMIOS_0_CH22_X_O
#undef PTE1_LPUART7_TX_I
#undef PTE1_LPUART7_TX_O
#undef PTE21_EMIOS_1_CH1_H_I
#undef PTE21_EMIOS_1_CH1_H_O
#undef PTE22_EMIOS_1_CH2_H_I
#undef PTE22_EMIOS_1_CH2_H_O
#undef PTE23_EMIOS_1_CH3_H_I
#undef PTE23_EMIOS_1_CH3_H_O
#undef PTE24_CAN2_TX
#undef PTE24_EMIOS_1_CH4_H_I
#undef PTE24_EMIOS_1_CH4_H_O
#undef PTE24_FXIO_D11_I
#undef PTE24_FXIO_D11_O
#undef PTE24_FXIO_D5_I
#undef PTE24_FXIO_D5_O
#undef PTE25_CAN2_RX
#undef PTE25_EMIOS_1_CH5_H_I
#undef PTE25_EMIOS_1_CH5_H_O
#undef PTE26_EMIOS_1_CH6_H_I
#undef PTE26_EMIOS_1_CH6_H_O
#undef PTE3_CAN4_TX
#undef PTE3_LPUART5_RX
#undef PTE4_EIRQ4
#undef PTE4_EMIOS_0_CH18_Y_I
#undef PTE4_EMIOS_0_CH18_Y_O
#undef PTE4_EMIOS_1_CH4_H_I
#undef PTE4_EMIOS_1_CH4_H_O
#undef PTE4_FXIO_D6_I
#undef PTE4_FXIO_D6_O
#undef PTE4_LPSPI0_PCS0_I
#undef PTE4_LPSPI0_PCS0_O
#undef PTE4_LPSPI1_PCS1_I
#undef PTE4_LPSPI1_PCS1_O
#undef PTE5_EIRQ5
#undef PTE5_EMIOS_0_CH19_Y_I
#undef PTE5_EMIOS_0_CH19_Y_O
#undef PTE5_EMIOS_1_CH5_H_I
#undef PTE5_EMIOS_1_CH5_H_O
#undef PTE5_FXIO_D7_I
#undef PTE5_FXIO_D7_O
#undef PTE7_LPUART4_RX
#undef PTE9_CAN3_TX

/* Signals specific to this part */
#define PTA15_LPUART1_DTR_B             NXP_SIUL2_PINMUX(0, 0, 15, 5, 0, 0)
#define PTA16_LPUART1_DSR_B             NXP_SIUL2_PINMUX(0, 0, 16, 0, 378, 1)
#define PTA17_TRGMUX_OUT0               NXP_SIUL2_PINMUX(0, 0, 17, 8, 0, 0)
#define PTA4_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 4, 0, 219, 6)
#define PTA4_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 4, 8, 0, 0)
#define PTA6_LPUART0_RIN_B              NXP_SIUL2_PINMUX(0, 0, 6, 0, 375, 1)
#define PTA7_LPUART0_DCD_B              NXP_SIUL2_PINMUX(0, 0, 7, 0, 374, 1)
#define PTB10_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PTB11_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 43, 0, 373, 2)
#define PTB12_LPUART0_DCD_B             NXP_SIUL2_PINMUX(0, 0, 44, 0, 374, 2)
#define PTB13_LPUART0_RIN_B             NXP_SIUL2_PINMUX(0, 0, 45, 0, 375, 2)
#define PTB4_CLKOUT_STANDBY             NXP_SIUL2_PINMUX(0, 0, 36, 8, 0, 0)
#define PTB8_LPUART1_DCD_B              NXP_SIUL2_PINMUX(0, 0, 40, 0, 377, 1)
#define PTB9_LPUART1_RIN_B              NXP_SIUL2_PINMUX(0, 0, 41, 0, 376, 1)
#define PTC10_LCU0_OUT1                 NXP_SIUL2_PINMUX(0, 0, 74, 8, 0, 0)
#define PTC10_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 74, 0, 373, 1)
#define PTC11_LCU0_OUT0                 NXP_SIUL2_PINMUX(0, 0, 75, 8, 0, 0)
#define PTC11_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)
#define PTC2_CAN1_RX                    NXP_SIUL2_PINMUX(0, 0, 66, 0, 1, 6)
#define PTC3_CAN1_TX                    NXP_SIUL2_PINMUX(0, 0, 67, 8, 0, 0)
#define PTC4_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 68, 0, 217, 7)
#define PTC4_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 68, 8, 0, 0)
#define PTD0_TRGMUX_IN7                 NXP_SIUL2_PINMUX(0, 0, 96, 0, 351, 2)
#define PTD1_TRGMUX_IN6                 NXP_SIUL2_PINMUX(0, 0, 97, 0, 350, 2)
#define PTE11_TRGMUX_IN8                NXP_SIUL2_PINMUX(0, 0, 139, 0, 352, 2)

#endif /* _ZEPHYR_DTS_BINDING_MCXE316MLF_WRAPPER_ */
